/**
* main.cpp
* Προγραμματιστικές τεχνικές, 4η εργασία
* Κύριο πρόγραμμα 
* Νικόλαος Κατωμέρης, 8551
* 03/11/2015
*/

#include <iostream>
#include "calendar.h"

int main()
{
	calendar a(10, 1, 2014), b(35, 14, 2015); //Δημιουργία των αντικειμένων a με δεκτή ημερομηνία, b με μη δεκτή ημερομηνία που διορθώνεται κατάλληλα.
	calendar c, d; //Δημιουργία των αντικειμένων c, d, e με μη αρχικοποιημένη ημερομηνία.
	a.getDate(); //Εμφάνιση της ημερομηνίας του a.
	b.getDate(); //Εμφάνιση της διορθωμένης πλέον ημερομηνίας του b.

	c = a + b; //'Αθροιση των ημερομηνιών των a, b και εκχώρηση του αθροίσματός τους στο c.
	d = a - b; //Αφαίρεση των ημερομηνιών των a, b και εκχώρηση της διαφοράς τους στο c.

	c.getDate(); //Εμφάνιση της ημερομηνίας του c.
	d.getDate(); //Εμφάνιση της ημερομηνίας του d.

	calendar f(a); //Δημιουργία του αντικειμένου e και κλήση της copy constructor για αντιγραφή του a στο e;
	calendar e = a; //Όμοιο με το παραπάνω με διαφορετικό τρόπο σύνταξης;
	calendar g;
	g = a; //Η αντιγραφή μπορεί να γίνει κι έτσι, παρά την ύπαρξη της συνάρτησης destructor, χάρη στην υπερφόρτωση του τελεστή "=".

	e.getDate(); //Εμφάνιση της ημερομηνίας του e.
	f.getDate(); //Εμφάνιση της ημερομηνίας του e.
	g.getDate(); //Εμφάνιση της ημερομηνίας του e.

	system("pause");
	return 0;
}
